# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [46]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [24]:
baby_names = pd.read_csv("US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [43]:
baby_names.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [13]:
baby_names.drop(labels=baby_names.columns[0:2], axis=1, inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [16]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [26]:
names = baby_names.groupby(by="Name")

In [27]:
names

### Step 8. How many different names exist in the dataset?

In [28]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [30]:
names.sum()["Count"].sort_values(ascending=False)[1]

214852

### Step 10. How many different names have the least occurrences?

In [32]:
(names.sum()["Count"] == 5).sum()

2578

### Step 11. What is the median name occurrence?

In [34]:
baby_names.groupby(by="Name").median()

         Unnamed: 0         Id    Year  Count
Name
Aaban     3866900.5  3866901.5  2013.5    6.0
Aadan      702439.0   702440.0  2008.5    5.5
Aadarsh   1728030.0  1728031.0  2009.0    5.0
Aaden     2867679.5  2867680.5  2010.0   10.0
Aadhav     709606.0   709607.0  2014.0    6.0
...             ...        ...     ...    ...
Zyra      1069863.0  1069864.0  2013.0    6.0
Zyrah     2743536.5  2743537.5  2012.0    5.5
Zyren     5074229.0  5074230.0  2013.0    6.0
Zyria     2139380.0  2139381.0  2008.0    6.0
Zyriah    4910877.0  4910878.0  2009.0    6.0

[17632 rows x 4 columns]

### Step 12. What is the standard deviation of names?

In [ ]:
#baby_names.groupby(by="Name").stdev()

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
#baby_name.groupby(by="Name").count.agg(["mean", "min", "max", "std", "quartiles"])